## Project 1

In [29]:
#importing pandas first
import pandas as pd
import plotly.io as pio

pio.renderers.default = "vscode+jupyterlab+notebook_connected"


The chosen dataset is: Affordable Housing Production by Building in NYC.
URL: https://data.cityofnewyork.us/Housing-Development/Affordable-Housing-Production-by-Building/hg8x-zxpr/about_data

In [30]:
#reading the dataset in

df=pd.read_csv("Affordable_Housing_Production_by_Building_20241107.csv")
df.head()

,Project ID,Project Name,Project Start Date,Project Completion Date,Building ID,Number,Street,Borough,Postcode,BBL,...,2-BR Units,3-BR Units,4-BR Units,5-BR Units,6-BR+ Units,Unknown-BR Units,Counted Rental Units,Counted Homeownership Units,All Counted Units,Total Units
0,68806,CADMAN PLAZA NORTH INC.PLP.FY24,06/28/2024,NaN,297417.0,140,CADMAN PLAZA WEST,Brooklyn,11201.0,3.002120e+09,...,150,51,0,0,0,0,251,251,251,251
1,69431,LOS SURES SIP HDFC.GHPP.FY24,06/28/2024,NaN,234667.0,747,DRIGGS AVENUE,Brooklyn,11211.0,3.024190e+09,...,14,1,0,0,0,0,21,0,21,21
2,69431,LOS SURES SIP HDFC.GHPP.FY24,06/28/2024,NaN,302578.0,262,GRAND STREET,Brooklyn,11211.0,3.023940e+09,...,16,7,0,0,0,0,23,0,23,23
3,69431,LOS SURES SIP HDFC.GHPP.FY24,06/28/2024,NaN,371841.0,249,SOUTH 1 STREET,Brooklyn,11211.0,3.023950e+09,...,8,1,0,0,0,0,17,0,17,17
4,69431,LOS SURES SIP HDFC.GHPP.FY24,06/28/2024,NaN,371960.0,184,SOUTH 2 STREET,Brooklyn,11211.0,3.024190e+09,...,9,6,0,0,0,0,18,0,18,18

In [31]:
#check what all columns the dataset has 

df.columns.unique()

Index(['Project ID', 'Project Name', 'Project Start Date',
       'Project Completion Date', 'Building ID', 'Number', 'Street', 'Borough',
       'Postcode', 'BBL', 'BIN', 'Community Board', 'Council District',
       'Census Tract', 'NTA - Neighborhood Tabulation Area', 'Latitude',
       'Longitude', 'Latitude (Internal)', 'Longitude (Internal)',
       'Building Completion Date', 'Reporting Construction Type',
       'Extended Affordability Only', 'Prevailing Wage Status',
       'Extremely Low Income Units', 'Very Low Income Units',
       'Low Income Units', 'Moderate Income Units', 'Middle Income Units',
       'Other Income Units', 'Studio Units', '1-BR Units', '2-BR Units',
       '3-BR Units', '4-BR Units', '5-BR Units', '6-BR+ Units',
       'Unknown-BR Units', 'Counted Rental Units',
       'Counted Homeownership Units', 'All Counted Units', 'Total Units'],
      dtype='object')

### I will be using the "Total Units" numerical column for my analysis.

In [32]:
mean_totalunits=df["Total Units"].mean()
print(f"The mean of total units is {mean_totalunits:.2f}")

The mean of total units is 46.98

In [33]:
median_totalunits=df["Total Units"].median()
print(f"The median is {median_totalunits}")

The median is 12.0

In [34]:
mode_totalunits=df["Total Units"].mode().iloc[0]
print(f"The mode is {mode_totalunits}.")

#iloc ensures we only pick up on 1 mode

The mode is 1.

#### Step 5: Using csv dict reader (not pandas)

The code below does the following:

- loops through each row in the file
- adds the number of total units to a running total
- keeps track of the number of rows in the dataset
- calculates an average of the number of total units at the end

In [35]:
import csv

sum_total_units=0
count_rows=0
with open("Affordable_Housing_Production_by_Building_20241107.csv") as csvfile:
    nyc_housing=csv.DictReader(csvfile)
    for row in nyc_housing:
        sum_total_units=sum_total_units+int(row["Total Units"])
        count_rows=count_rows+1
    print(f"The total number of affordable housing units is {sum_total_units}")
    print(f"The number of entries in the dataset is {count_rows}")
    mean_units=sum_total_units/count_rows
    print(f"The mean number of housing units in the dataset is {mean_units:.2f}")

The total number of affordable housing units is 358790
The number of entries in the dataset is 7637
The mean number of housing units in the dataset is 46.98

The code below does the following:
- makes a list of all the values in the Total units column.
- sorts the list in ascending order
- checks how many elements there are in the list
- picks the middle value in the ordered list, which is the median

In [36]:
total_units=[]

with open("Affordable_Housing_Production_by_Building_20241107.csv") as csvfile:
    nyc_housing=csv.DictReader(csvfile)    
    for row in nyc_housing:
        units=row["Total Units"]
        total_units.append(int(units)) 
    total_units.sort() 
    n=len(total_units) 
    median=total_units[int(n/2)] 
    print(f"The median is {median}.")

The median is 12.

The code below does the following:
- Creates an empty dictionary
- for each unique value in the list of total units, adds it to the dictionary as a key
- keeps track of how many times the key occurs and stores that count as the value in the dictionary
- checks which is the maximum value, and gives the key associated with it, which is the mode

In [37]:
mode_tracker=dict()
for x in total_units:
    if x in mode_tracker: #makes a dictionary which has each unique value of total units as the key, and the number of times it occurs as the value.
        mode_tracker[x]+=1
    else:
        mode_tracker[x]=1

max_count=max(mode_tracker.values()) #checks which is the highest value
mode=[key for key,value in mode_tracker.items() if value==max_count] #calls on the key for the highest value. note: its a list because there can be multiple modes.
print(f"The mode is {mode}.")

The mode is [1].

#### Data visualization:

In [38]:
df=df[["Project ID","Borough","Total Units"]]
df

      Project ID        Borough  Total Units
0          68806       Brooklyn          251
1          69431       Brooklyn           21
2          69431       Brooklyn           23
3          69431       Brooklyn           17
4          69431       Brooklyn           18
...          ...            ...          ...
7632       55697       Brooklyn            1
7633       55773  Staten Island            1
7634       57341  Staten Island            1
7635       55647       Brooklyn            1
7636       55759         Queens            1

[7637 rows x 3 columns]

In [39]:
#sums the total no. of units in each borough and makes a new df with this info

df_byboro=df.groupby("Borough")["Total Units"].sum().reset_index(name="Total Units per Borough")
df_byboro

         Borough  Total Units per Borough
0          Bronx                    99777
1       Brooklyn                   118056
2      Manhattan                    88325
3         Queens                    48635
4  Staten Island                     3997

In [40]:
def tenthous_units(x):
    y=int(x/10000)
    return y

In [41]:
#creates a new column - which has the total units per borough, but in thousands

df_byboro["Units per Borough (10,000s)"]=df_byboro["Total Units per Borough"].apply(tenthous_units)
df_byboro["Units per Borough (10,000s)"]=df_byboro["Units per Borough (10,000s)"].astype(int)
df_byboro

         Borough  Total Units per Borough  Units per Borough (10,000s)
0          Bronx                    99777                            9
1       Brooklyn                   118056                           11
2      Manhattan                    88325                            8
3         Queens                    48635                            4
4  Staten Island                     3997                            0

In [42]:
#creates the visualization using the new 000s units column for each borough. 
#iterates through the rows in the previous df and for each borough it prints the no. of stars based on the no. of 1000s units in the borough.

print(f"Total Number of Housing Units per Borough (10,000s)")
for index, row in df_byboro.iterrows():
    borough=row["Borough"]
    stars=row["Units per Borough (10,000s)"]
    print(f"{borough}: {"*"*stars}")

Total Number of Housing Units per Borough (10,000s)
Bronx: *********
Brooklyn: ***********
Manhattan: ********
Queens: ****
Staten Island: